---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.ContFootingRadiusTooSmall
source: html/d43634c6-8442-9ec5-d7f6-ef8fa35f01bf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.ContFootingRadiusTooSmall Property

Can't display the Wall Foundation, because the Wall's radius is too small. Please increase the radius to display the Wall Foundation.

## Syntax (C#)
```csharp
public static FailureDefinitionId ContFootingRadiusTooSmall { get; }
```